/*
    название: перебор из массива
    
    описание:
        написать функцию которая приинимает массив
        и возврщает массив всех возможных вариантов без повторениий
        
    
    теги: [массивы]
    
    сложность: 40 мин
    
    уровень автора: 2
    
    тесты:
        connst nums = [1,2,3]
        cost res =  [[],[1],[2],[1,2],[3],[1,3],[2,3],[1,2,3]]

        const nums1 = [1, 2, 3, 4];
        const res1 = [
          [],
          [1],
          [2],
          [2, 1],
          [3],
          [3, 1],
          [3, 2],
          [3, 2, 1],
          [4],
          [4, 1],
          [4, 2],
          [4, 2, 1],
          [4, 3],
          [4, 3, 1],
          [4, 3, 2],
          [4, 3, 2, 1],
        ];

    решение:
        const subsets = (nums) =>
          nums.reduce(
            (subsets, value) => [...subsets, ...subsets.map((set) => [value, ...set])],
            [[]]
          );
*/

